{"keras_version": "2.0.4", "class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "dtype": "float32", "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 1, "momentum": 0.99, "batch_input_shape": [null, 1, 64, 64], "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [2, 2], "kernel_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "dilation_rate": [1, 1], "filters": 128, "activity_regularizer": null, "name": "conv2d_4", "use_bias": true, "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "bias_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_4", "data_format": "channels_first", "padding": "valid", "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "kernel_size": [2, 2], "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "dilation_rate": [1, 1], "filters": 256, "activity_regularizer": null, "name": "conv2d_5", "use_bias": true, "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "bias_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_5", "data_format": "channels_first", "padding": "valid", "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "kernel_size": [2, 2], "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "dilation_rate": [1, 1], "filters": 256, "activity_regularizer": null, "name": "conv2d_6", "use_bias": true, "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "bias_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_9", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_6", "data_format": "channels_first", "padding": "valid", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "units": 50, "activation": "linear", "activity_regularizer": null, "name": "dense_4", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_10", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.6}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "units": 50, "activation": "linear", "activity_regularizer": null, "name": "dense_5", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_11", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "rate": 0.6}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "units": 3, "activation": "linear", "activity_regularizer": null, "name": "dense_6", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_12", "activation": "softmax", "trainable": true}}], "backend": "tensorflow"}