{"keras_version": "2.0.4", "config": [{"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "batch_input_shape": [null, 1, 256, 256], "center": true, "name": "batch_normalization_1", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 1, "dtype": "float32", "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"bias_constraint": null, "filters": 32, "activity_regularizer": null, "name": "conv2d_1", "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "strides": [2, 2], "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "data_format": "channels_first", "padding": "valid", "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "data_format": "channels_first", "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "filters": 64, "activity_regularizer": null, "name": "conv2d_2", "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "data_format": "channels_first", "padding": "same", "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "data_format": "channels_first", "strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "filters": 128, "activity_regularizer": null, "name": "conv2d_3", "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "data_format": "channels_first", "padding": "same", "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "data_format": "channels_first", "strides": [2, 2], "name": "max_pooling2d_3", "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 50, "bias_constraint": null, "activity_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "TruncatedNormal"}, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.6}, "class_name": "Dropout"}, {"config": {"units": 50, "bias_constraint": null, "activity_regularizer": null, "name": "dense_2", "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "TruncatedNormal"}, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.6}, "class_name": "Dropout"}, {"config": {"units": 3, "bias_constraint": null, "activity_regularizer": null, "name": "dense_3", "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_6", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow"}