{"class_name": "Model", "keras_version": "2.0.4", "config": {"layers": [{"class_name": "InputLayer", "name": "data", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 224, 224, 1], "dtype": "float32", "name": "data"}}, {"class_name": "ZeroPadding2D", "name": "conv1_zeropadding", "inbound_nodes": [[["data", 0, 0, {}]]], "config": {"trainable": true, "name": "conv1_zeropadding", "data_format": "channels_last", "padding": [[3, 3], [3, 3]]}}, {"class_name": "Conv2D", "name": "conv1", "inbound_nodes": [[["conv1_zeropadding", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv1", "data_format": "channels_last", "trainable": true, "kernel_size": [7, 7], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "filters": 32, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [2, 2], "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv1_bn", "inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_regularizer": null, "name": "conv1_bn", "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.1e-05}}, {"class_name": "Scale", "name": "conv1_scale", "inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "config": {"trainable": true, "momentum": 0.9, "axis": 3, "name": "conv1_scale"}}, {"class_name": "Activation", "name": "relu1", "inbound_nodes": [[["conv1_scale", 0, 0, {}]]], "config": {"trainable": true, "name": "relu1", "activation": "relu"}}, {"class_name": "ZeroPadding2D", "name": "pool1_zeropadding", "inbound_nodes": [[["relu1", 0, 0, {}]]], "config": {"trainable": true, "name": "pool1_zeropadding", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"class_name": "MaxPooling2D", "name": "pool1", "inbound_nodes": [[["pool1_zeropadding", 0, 0, {}]]], "config": {"trainable": true, "name": "pool1", "data_format": "channels_last", "padding": "valid", "pool_size": [3, 3], "strides": [2, 2]}}, {"class_name": "BatchNormalization", "name": "conv2_1_x1_bn", "inbound_nodes": [[["pool1", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_regularizer": null, "name": "conv2_1_x1_bn", "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.1e-05}}, {"class_name": "Scale", "name": "conv2_1_x1_scale", "inbound_nodes": [[["conv2_1_x1_bn", 0, 0, {}]]], "config": {"trainable": true, "momentum": 0.9, "axis": 3, "name": "conv2_1_x1_scale"}}, {"class_name": "Activation", "name": "relu2_1_x1", "inbound_nodes": [[["conv2_1_x1_scale", 0, 0, {}]]], "config": {"trainable": true, "name": "relu2_1_x1", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2_1_x1", "inbound_nodes": [[["relu2_1_x1", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv2_1_x1", "data_format": "channels_last", "trainable": true, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "filters": 48, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv2_1_x2_bn", "inbound_nodes": [[["conv2_1_x1", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_regularizer": null, "name": "conv2_1_x2_bn", "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.1e-05}}, {"class_name": "Scale", "name": "conv2_1_x2_scale", "inbound_nodes": [[["conv2_1_x2_bn", 0, 0, {}]]], "config": {"trainable": true, "momentum": 0.9, "axis": 3, "name": "conv2_1_x2_scale"}}, {"class_name": "Activation", "name": "relu2_1_x2", "inbound_nodes": [[["conv2_1_x2_scale", 0, 0, {}]]], "config": {"trainable": true, "name": "relu2_1_x2", "activation": "relu"}}, {"class_name": "ZeroPadding2D", "name": "conv2_1_x2_zeropadding", "inbound_nodes": [[["relu2_1_x2", 0, 0, {}]]], "config": {"trainable": true, "name": "conv2_1_x2_zeropadding", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"class_name": "Conv2D", "name": "conv2_1_x2", "inbound_nodes": [[["conv2_1_x2_zeropadding", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv2_1_x2", "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "filters": 12, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "kernel_regularizer": null}}, {"class_name": "Merge", "name": "concat_2_1", "inbound_nodes": [[["pool1", 0, 0, {"mask": [null, null]}], ["conv2_1_x2", 0, 0, {"mask": [null, null]}]]], "config": {"concat_axis": 3, "mode": "concat", "output_shape": null, "name": "concat_2_1", "output_mask_type": "raw", "dot_axes": -1, "mode_type": "raw", "output_mask": null, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "BatchNormalization", "name": "conv2_2_x1_bn", "inbound_nodes": [[["concat_2_1", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_regularizer": null, "name": "conv2_2_x1_bn", "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.1e-05}}, {"class_name": "Scale", "name": "conv2_2_x1_scale", "inbound_nodes": [[["conv2_2_x1_bn", 0, 0, {}]]], "config": {"trainable": true, "momentum": 0.9, "axis": 3, "name": "conv2_2_x1_scale"}}, {"class_name": "Activation", "name": "relu2_2_x1", "inbound_nodes": [[["conv2_2_x1_scale", 0, 0, {}]]], "config": {"trainable": true, "name": "relu2_2_x1", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2_2_x1", "inbound_nodes": [[["relu2_2_x1", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv2_2_x1", "data_format": "channels_last", "trainable": true, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "filters": 48, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv2_2_x2_bn", "inbound_nodes": [[["conv2_2_x1", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_regularizer": null, "name": "conv2_2_x2_bn", "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.1e-05}}, {"class_name": "Scale", "name": "conv2_2_x2_scale", "inbound_nodes": [[["conv2_2_x2_bn", 0, 0, {}]]], "config": {"trainable": true, "momentum": 0.9, "axis": 3, "name": "conv2_2_x2_scale"}}, {"class_name": "Activation", "name": "relu2_2_x2", "inbound_nodes": [[["conv2_2_x2_scale", 0, 0, {}]]], "config": {"trainable": true, "name": "relu2_2_x2", "activation": "relu"}}, {"class_name": "ZeroPadding2D", "name": "conv2_2_x2_zeropadding", "inbound_nodes": [[["relu2_2_x2", 0, 0, {}]]], "config": {"trainable": true, "name": "conv2_2_x2_zeropadding", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"class_name": "Conv2D", "name": "conv2_2_x2", "inbound_nodes": [[["conv2_2_x2_zeropadding", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv2_2_x2", "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "filters": 12, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "kernel_regularizer": null}}, {"class_name": "Merge", "name": "concat_2_2", "inbound_nodes": [[["concat_2_1", 0, 0, {"mask": [null, null]}], ["conv2_2_x2", 0, 0, {"mask": [null, null]}]]], "config": {"concat_axis": 3, "mode": "concat", "output_shape": null, "name": "concat_2_2", "output_mask_type": "raw", "dot_axes": -1, "mode_type": "raw", "output_mask": null, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "BatchNormalization", "name": "conv2_3_x1_bn", "inbound_nodes": [[["concat_2_2", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_regularizer": null, "name": "conv2_3_x1_bn", "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.1e-05}}, {"class_name": "Scale", "name": "conv2_3_x1_scale", "inbound_nodes": [[["conv2_3_x1_bn", 0, 0, {}]]], "config": {"trainable": true, "momentum": 0.9, "axis": 3, "name": "conv2_3_x1_scale"}}, {"class_name": "Activation", "name": "relu2_3_x1", "inbound_nodes": [[["conv2_3_x1_scale", 0, 0, {}]]], "config": {"trainable": true, "name": "relu2_3_x1", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2_3_x1", "inbound_nodes": [[["relu2_3_x1", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv2_3_x1", "data_format": "channels_last", "trainable": true, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "filters": 48, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv2_3_x2_bn", "inbound_nodes": [[["conv2_3_x1", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_regularizer": null, "name": "conv2_3_x2_bn", "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.1e-05}}, {"class_name": "Scale", "name": "conv2_3_x2_scale", "inbound_nodes": [[["conv2_3_x2_bn", 0, 0, {}]]], "config": {"trainable": true, "momentum": 0.9, "axis": 3, "name": "conv2_3_x2_scale"}}, {"class_name": "Activation", "name": "relu2_3_x2", "inbound_nodes": [[["conv2_3_x2_scale", 0, 0, {}]]], "config": {"trainable": true, "name": "relu2_3_x2", "activation": "relu"}}, {"class_name": "ZeroPadding2D", "name": "conv2_3_x2_zeropadding", "inbound_nodes": [[["relu2_3_x2", 0, 0, {}]]], "config": {"trainable": true, "name": "conv2_3_x2_zeropadding", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"class_name": "Conv2D", "name": "conv2_3_x2", "inbound_nodes": [[["conv2_3_x2_zeropadding", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv2_3_x2", "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "filters": 12, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "kernel_regularizer": null}}, {"class_name": "Merge", "name": "concat_2_3", "inbound_nodes": [[["concat_2_2", 0, 0, {"mask": [null, null]}], ["conv2_3_x2", 0, 0, {"mask": [null, null]}]]], "config": {"concat_axis": 3, "mode": "concat", "output_shape": null, "name": "concat_2_3", "output_mask_type": "raw", "dot_axes": -1, "mode_type": "raw", "output_mask": null, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "BatchNormalization", "name": "conv2_4_x1_bn", "inbound_nodes": [[["concat_2_3", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_regularizer": null, "name": "conv2_4_x1_bn", "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.1e-05}}, {"class_name": "Scale", "name": "conv2_4_x1_scale", "inbound_nodes": [[["conv2_4_x1_bn", 0, 0, {}]]], "config": {"trainable": true, "momentum": 0.9, "axis": 3, "name": "conv2_4_x1_scale"}}, {"class_name": "Activation", "name": "relu2_4_x1", "inbound_nodes": [[["conv2_4_x1_scale", 0, 0, {}]]], "config": {"trainable": true, "name": "relu2_4_x1", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2_4_x1", "inbound_nodes": [[["relu2_4_x1", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv2_4_x1", "data_format": "channels_last", "trainable": true, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "filters": 48, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv2_4_x2_bn", "inbound_nodes": [[["conv2_4_x1", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_regularizer": null, "name": "conv2_4_x2_bn", "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.1e-05}}, {"class_name": "Scale", "name": "conv2_4_x2_scale", "inbound_nodes": [[["conv2_4_x2_bn", 0, 0, {}]]], "config": {"trainable": true, "momentum": 0.9, "axis": 3, "name": "conv2_4_x2_scale"}}, {"class_name": "Activation", "name": "relu2_4_x2", "inbound_nodes": [[["conv2_4_x2_scale", 0, 0, {}]]], "config": {"trainable": true, "name": "relu2_4_x2", "activation": "relu"}}, {"class_name": "ZeroPadding2D", "name": "conv2_4_x2_zeropadding", "inbound_nodes": [[["relu2_4_x2", 0, 0, {}]]], "config": {"trainable": true, "name": "conv2_4_x2_zeropadding", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"class_name": "Conv2D", "name": "conv2_4_x2", "inbound_nodes": [[["conv2_4_x2_zeropadding", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv2_4_x2", "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "filters": 12, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "kernel_regularizer": null}}, {"class_name": "Merge", "name": "concat_2_4", "inbound_nodes": [[["concat_2_3", 0, 0, {"mask": [null, null]}], ["conv2_4_x2", 0, 0, {"mask": [null, null]}]]], "config": {"concat_axis": 3, "mode": "concat", "output_shape": null, "name": "concat_2_4", "output_mask_type": "raw", "dot_axes": -1, "mode_type": "raw", "output_mask": null, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "BatchNormalization", "name": "conv2_5_x1_bn", "inbound_nodes": [[["concat_2_4", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_regularizer": null, "name": "conv2_5_x1_bn", "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.1e-05}}, {"class_name": "Scale", "name": "conv2_5_x1_scale", "inbound_nodes": [[["conv2_5_x1_bn", 0, 0, {}]]], "config": {"trainable": true, "momentum": 0.9, "axis": 3, "name": "conv2_5_x1_scale"}}, {"class_name": "Activation", "name": "relu2_5_x1", "inbound_nodes": [[["conv2_5_x1_scale", 0, 0, {}]]], "config": {"trainable": true, "name": "relu2_5_x1", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2_5_x1", "inbound_nodes": [[["relu2_5_x1", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv2_5_x1", "data_format": "channels_last", "trainable": true, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "filters": 48, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv2_5_x2_bn", "inbound_nodes": [[["conv2_5_x1", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_regularizer": null, "name": "conv2_5_x2_bn", "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.1e-05}}, {"class_name": "Scale", "name": "conv2_5_x2_scale", "inbound_nodes": [[["conv2_5_x2_bn", 0, 0, {}]]], "config": {"trainable": true, "momentum": 0.9, "axis": 3, "name": "conv2_5_x2_scale"}}, {"class_name": "Activation", "name": "relu2_5_x2", "inbound_nodes": [[["conv2_5_x2_scale", 0, 0, {}]]], "config": {"trainable": true, "name": "relu2_5_x2", "activation": "relu"}}, {"class_name": "ZeroPadding2D", "name": "conv2_5_x2_zeropadding", "inbound_nodes": [[["relu2_5_x2", 0, 0, {}]]], "config": {"trainable": true, "name": "conv2_5_x2_zeropadding", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"class_name": "Conv2D", "name": "conv2_5_x2", "inbound_nodes": [[["conv2_5_x2_zeropadding", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv2_5_x2", "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "filters": 12, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "kernel_regularizer": null}}, {"class_name": "Merge", "name": "concat_2_5", "inbound_nodes": [[["concat_2_4", 0, 0, {"mask": [null, null]}], ["conv2_5_x2", 0, 0, {"mask": [null, null]}]]], "config": {"concat_axis": 3, "mode": "concat", "output_shape": null, "name": "concat_2_5", "output_mask_type": "raw", "dot_axes": -1, "mode_type": "raw", "output_mask": null, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "BatchNormalization", "name": "conv2_6_x1_bn", "inbound_nodes": [[["concat_2_5", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_regularizer": null, "name": "conv2_6_x1_bn", "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.1e-05}}, {"class_name": "Scale", "name": "conv2_6_x1_scale", "inbound_nodes": [[["conv2_6_x1_bn", 0, 0, {}]]], "config": {"trainable": true, "momentum": 0.9, "axis": 3, "name": "conv2_6_x1_scale"}}, {"class_name": "Activation", "name": "relu2_6_x1", "inbound_nodes": [[["conv2_6_x1_scale", 0, 0, {}]]], "config": {"trainable": true, "name": "relu2_6_x1", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2_6_x1", "inbound_nodes": [[["relu2_6_x1", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv2_6_x1", "data_format": "channels_last", "trainable": true, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "filters": 48, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv2_6_x2_bn", "inbound_nodes": [[["conv2_6_x1", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_regularizer": null, "name": "conv2_6_x2_bn", "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.1e-05}}, {"class_name": "Scale", "name": "conv2_6_x2_scale", "inbound_nodes": [[["conv2_6_x2_bn", 0, 0, {}]]], "config": {"trainable": true, "momentum": 0.9, "axis": 3, "name": "conv2_6_x2_scale"}}, {"class_name": "Activation", "name": "relu2_6_x2", "inbound_nodes": [[["conv2_6_x2_scale", 0, 0, {}]]], "config": {"trainable": true, "name": "relu2_6_x2", "activation": "relu"}}, {"class_name": "ZeroPadding2D", "name": "conv2_6_x2_zeropadding", "inbound_nodes": [[["relu2_6_x2", 0, 0, {}]]], "config": {"trainable": true, "name": "conv2_6_x2_zeropadding", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"class_name": "Conv2D", "name": "conv2_6_x2", "inbound_nodes": [[["conv2_6_x2_zeropadding", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv2_6_x2", "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "filters": 12, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "kernel_regularizer": null}}, {"class_name": "Merge", "name": "concat_2_6", "inbound_nodes": [[["concat_2_5", 0, 0, {"mask": [null, null]}], ["conv2_6_x2", 0, 0, {"mask": [null, null]}]]], "config": {"concat_axis": 3, "mode": "concat", "output_shape": null, "name": "concat_2_6", "output_mask_type": "raw", "dot_axes": -1, "mode_type": "raw", "output_mask": null, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "BatchNormalization", "name": "conv2_blk_bn", "inbound_nodes": [[["concat_2_6", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_regularizer": null, "name": "conv2_blk_bn", "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.1e-05}}, {"class_name": "Scale", "name": "conv2_blk_scale", "inbound_nodes": [[["conv2_blk_bn", 0, 0, {}]]], "config": {"trainable": true, "momentum": 0.9, "axis": 3, "name": "conv2_blk_scale"}}, {"class_name": "Activation", "name": "relu2_blk", "inbound_nodes": [[["conv2_blk_scale", 0, 0, {}]]], "config": {"trainable": true, "name": "relu2_blk", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2_blk", "inbound_nodes": [[["relu2_blk", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv2_blk", "data_format": "channels_last", "trainable": true, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "filters": 52, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "kernel_regularizer": null}}, {"class_name": "AveragePooling2D", "name": "pool2", "inbound_nodes": [[["conv2_blk", 0, 0, {}]]], "config": {"trainable": true, "name": "pool2", "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "BatchNormalization", "name": "conv3_1_x1_bn", "inbound_nodes": [[["pool2", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_regularizer": null, "name": "conv3_1_x1_bn", "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.1e-05}}, {"class_name": "Scale", "name": "conv3_1_x1_scale", "inbound_nodes": [[["conv3_1_x1_bn", 0, 0, {}]]], "config": {"trainable": true, "momentum": 0.9, "axis": 3, "name": "conv3_1_x1_scale"}}, {"class_name": "Activation", "name": "relu3_1_x1", "inbound_nodes": [[["conv3_1_x1_scale", 0, 0, {}]]], "config": {"trainable": true, "name": "relu3_1_x1", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv3_1_x1", "inbound_nodes": [[["relu3_1_x1", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv3_1_x1", "data_format": "channels_last", "trainable": true, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "filters": 48, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv3_1_x2_bn", "inbound_nodes": [[["conv3_1_x1", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_regularizer": null, "name": "conv3_1_x2_bn", "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.1e-05}}, {"class_name": "Scale", "name": "conv3_1_x2_scale", "inbound_nodes": [[["conv3_1_x2_bn", 0, 0, {}]]], "config": {"trainable": true, "momentum": 0.9, "axis": 3, "name": "conv3_1_x2_scale"}}, {"class_name": "Activation", "name": "relu3_1_x2", "inbound_nodes": [[["conv3_1_x2_scale", 0, 0, {}]]], "config": {"trainable": true, "name": "relu3_1_x2", "activation": "relu"}}, {"class_name": "ZeroPadding2D", "name": "conv3_1_x2_zeropadding", "inbound_nodes": [[["relu3_1_x2", 0, 0, {}]]], "config": {"trainable": true, "name": "conv3_1_x2_zeropadding", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"class_name": "Conv2D", "name": "conv3_1_x2", "inbound_nodes": [[["conv3_1_x2_zeropadding", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv3_1_x2", "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "filters": 12, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "kernel_regularizer": null}}, {"class_name": "Merge", "name": "concat_3_1", "inbound_nodes": [[["pool2", 0, 0, {"mask": [null, null]}], ["conv3_1_x2", 0, 0, {"mask": [null, null]}]]], "config": {"concat_axis": 3, "mode": "concat", "output_shape": null, "name": "concat_3_1", "output_mask_type": "raw", "dot_axes": -1, "mode_type": "raw", "output_mask": null, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "BatchNormalization", "name": "conv3_2_x1_bn", "inbound_nodes": [[["concat_3_1", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_regularizer": null, "name": "conv3_2_x1_bn", "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.1e-05}}, {"class_name": "Scale", "name": "conv3_2_x1_scale", "inbound_nodes": [[["conv3_2_x1_bn", 0, 0, {}]]], "config": {"trainable": true, "momentum": 0.9, "axis": 3, "name": "conv3_2_x1_scale"}}, {"class_name": "Activation", "name": "relu3_2_x1", "inbound_nodes": [[["conv3_2_x1_scale", 0, 0, {}]]], "config": {"trainable": true, "name": "relu3_2_x1", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv3_2_x1", "inbound_nodes": [[["relu3_2_x1", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv3_2_x1", "data_format": "channels_last", "trainable": true, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "filters": 48, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv3_2_x2_bn", "inbound_nodes": [[["conv3_2_x1", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_regularizer": null, "name": "conv3_2_x2_bn", "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.1e-05}}, {"class_name": "Scale", "name": "conv3_2_x2_scale", "inbound_nodes": [[["conv3_2_x2_bn", 0, 0, {}]]], "config": {"trainable": true, "momentum": 0.9, "axis": 3, "name": "conv3_2_x2_scale"}}, {"class_name": "Activation", "name": "relu3_2_x2", "inbound_nodes": [[["conv3_2_x2_scale", 0, 0, {}]]], "config": {"trainable": true, "name": "relu3_2_x2", "activation": "relu"}}, {"class_name": "ZeroPadding2D", "name": "conv3_2_x2_zeropadding", "inbound_nodes": [[["relu3_2_x2", 0, 0, {}]]], "config": {"trainable": true, "name": "conv3_2_x2_zeropadding", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"class_name": "Conv2D", "name": "conv3_2_x2", "inbound_nodes": [[["conv3_2_x2_zeropadding", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv3_2_x2", "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "filters": 12, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "kernel_regularizer": null}}, {"class_name": "Merge", "name": "concat_3_2", "inbound_nodes": [[["concat_3_1", 0, 0, {"mask": [null, null]}], ["conv3_2_x2", 0, 0, {"mask": [null, null]}]]], "config": {"concat_axis": 3, "mode": "concat", "output_shape": null, "name": "concat_3_2", "output_mask_type": "raw", "dot_axes": -1, "mode_type": "raw", "output_mask": null, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "BatchNormalization", "name": "conv3_3_x1_bn", "inbound_nodes": [[["concat_3_2", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_regularizer": null, "name": "conv3_3_x1_bn", "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.1e-05}}, {"class_name": "Scale", "name": "conv3_3_x1_scale", "inbound_nodes": [[["conv3_3_x1_bn", 0, 0, {}]]], "config": {"trainable": true, "momentum": 0.9, "axis": 3, "name": "conv3_3_x1_scale"}}, {"class_name": "Activation", "name": "relu3_3_x1", "inbound_nodes": [[["conv3_3_x1_scale", 0, 0, {}]]], "config": {"trainable": true, "name": "relu3_3_x1", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv3_3_x1", "inbound_nodes": [[["relu3_3_x1", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv3_3_x1", "data_format": "channels_last", "trainable": true, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "filters": 48, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv3_3_x2_bn", "inbound_nodes": [[["conv3_3_x1", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_regularizer": null, "name": "conv3_3_x2_bn", "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.1e-05}}, {"class_name": "Scale", "name": "conv3_3_x2_scale", "inbound_nodes": [[["conv3_3_x2_bn", 0, 0, {}]]], "config": {"trainable": true, "momentum": 0.9, "axis": 3, "name": "conv3_3_x2_scale"}}, {"class_name": "Activation", "name": "relu3_3_x2", "inbound_nodes": [[["conv3_3_x2_scale", 0, 0, {}]]], "config": {"trainable": true, "name": "relu3_3_x2", "activation": "relu"}}, {"class_name": "ZeroPadding2D", "name": "conv3_3_x2_zeropadding", "inbound_nodes": [[["relu3_3_x2", 0, 0, {}]]], "config": {"trainable": true, "name": "conv3_3_x2_zeropadding", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"class_name": "Conv2D", "name": "conv3_3_x2", "inbound_nodes": [[["conv3_3_x2_zeropadding", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv3_3_x2", "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "filters": 12, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "kernel_regularizer": null}}, {"class_name": "Merge", "name": "concat_3_3", "inbound_nodes": [[["concat_3_2", 0, 0, {"mask": [null, null]}], ["conv3_3_x2", 0, 0, {"mask": [null, null]}]]], "config": {"concat_axis": 3, "mode": "concat", "output_shape": null, "name": "concat_3_3", "output_mask_type": "raw", "dot_axes": -1, "mode_type": "raw", "output_mask": null, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "BatchNormalization", "name": "conv3_4_x1_bn", "inbound_nodes": [[["concat_3_3", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_regularizer": null, "name": "conv3_4_x1_bn", "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.1e-05}}, {"class_name": "Scale", "name": "conv3_4_x1_scale", "inbound_nodes": [[["conv3_4_x1_bn", 0, 0, {}]]], "config": {"trainable": true, "momentum": 0.9, "axis": 3, "name": "conv3_4_x1_scale"}}, {"class_name": "Activation", "name": "relu3_4_x1", "inbound_nodes": [[["conv3_4_x1_scale", 0, 0, {}]]], "config": {"trainable": true, "name": "relu3_4_x1", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv3_4_x1", "inbound_nodes": [[["relu3_4_x1", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv3_4_x1", "data_format": "channels_last", "trainable": true, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "filters": 48, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv3_4_x2_bn", "inbound_nodes": [[["conv3_4_x1", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_regularizer": null, "name": "conv3_4_x2_bn", "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.1e-05}}, {"class_name": "Scale", "name": "conv3_4_x2_scale", "inbound_nodes": [[["conv3_4_x2_bn", 0, 0, {}]]], "config": {"trainable": true, "momentum": 0.9, "axis": 3, "name": "conv3_4_x2_scale"}}, {"class_name": "Activation", "name": "relu3_4_x2", "inbound_nodes": [[["conv3_4_x2_scale", 0, 0, {}]]], "config": {"trainable": true, "name": "relu3_4_x2", "activation": "relu"}}, {"class_name": "ZeroPadding2D", "name": "conv3_4_x2_zeropadding", "inbound_nodes": [[["relu3_4_x2", 0, 0, {}]]], "config": {"trainable": true, "name": "conv3_4_x2_zeropadding", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"class_name": "Conv2D", "name": "conv3_4_x2", "inbound_nodes": [[["conv3_4_x2_zeropadding", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv3_4_x2", "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "filters": 12, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "kernel_regularizer": null}}, {"class_name": "Merge", "name": "concat_3_4", "inbound_nodes": [[["concat_3_3", 0, 0, {"mask": [null, null]}], ["conv3_4_x2", 0, 0, {"mask": [null, null]}]]], "config": {"concat_axis": 3, "mode": "concat", "output_shape": null, "name": "concat_3_4", "output_mask_type": "raw", "dot_axes": -1, "mode_type": "raw", "output_mask": null, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "BatchNormalization", "name": "conv3_5_x1_bn", "inbound_nodes": [[["concat_3_4", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_regularizer": null, "name": "conv3_5_x1_bn", "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.1e-05}}, {"class_name": "Scale", "name": "conv3_5_x1_scale", "inbound_nodes": [[["conv3_5_x1_bn", 0, 0, {}]]], "config": {"trainable": true, "momentum": 0.9, "axis": 3, "name": "conv3_5_x1_scale"}}, {"class_name": "Activation", "name": "relu3_5_x1", "inbound_nodes": [[["conv3_5_x1_scale", 0, 0, {}]]], "config": {"trainable": true, "name": "relu3_5_x1", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv3_5_x1", "inbound_nodes": [[["relu3_5_x1", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv3_5_x1", "data_format": "channels_last", "trainable": true, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "filters": 48, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv3_5_x2_bn", "inbound_nodes": [[["conv3_5_x1", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_regularizer": null, "name": "conv3_5_x2_bn", "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.1e-05}}, {"class_name": "Scale", "name": "conv3_5_x2_scale", "inbound_nodes": [[["conv3_5_x2_bn", 0, 0, {}]]], "config": {"trainable": true, "momentum": 0.9, "axis": 3, "name": "conv3_5_x2_scale"}}, {"class_name": "Activation", "name": "relu3_5_x2", "inbound_nodes": [[["conv3_5_x2_scale", 0, 0, {}]]], "config": {"trainable": true, "name": "relu3_5_x2", "activation": "relu"}}, {"class_name": "ZeroPadding2D", "name": "conv3_5_x2_zeropadding", "inbound_nodes": [[["relu3_5_x2", 0, 0, {}]]], "config": {"trainable": true, "name": "conv3_5_x2_zeropadding", "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}}, {"class_name": "Conv2D", "name": "conv3_5_x2", "inbound_nodes": [[["conv3_5_x2_zeropadding", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv3_5_x2", "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "filters": 12, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "kernel_regularizer": null}}, {"class_name": "Merge", "name": "concat_3_5", "inbound_nodes": [[["concat_3_4", 0, 0, {"mask": [null, null]}], ["conv3_5_x2", 0, 0, {"mask": [null, null]}]]], "config": {"concat_axis": 3, "mode": "concat", "output_shape": null, "name": "concat_3_5", "output_mask_type": "raw", "dot_axes": -1, "mode_type": "raw", "output_mask": null, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "BatchNormalization", "name": "conv3_6_x1_bn", "inbound_nodes": [[["concat_3_5", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_regularizer": null, "name": "conv3_6_x1_bn", "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.1e-05}}, {"class_name": "Scale", "name": "conv3_6_x1_scale", "inbound_nodes": [[["conv3_6_x1_bn", 0, 0, {}]]], "config": {"trainable": true, "momentum": 0.9, "axis": 3, "name": "conv3_6_x1_scale"}}, {"class_name": "Activation", "name": "relu3_6_x1", "inbound_nodes": [[["conv3_6_x1_scale", 0, 0, {}]]], "config": {"trainable": true, "name": "relu3_6_x1", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv3_6_x1", "inbound_nodes": [[["relu3_6_x1", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv3_6_x1", "data_format": "channels_last", "trainable": true, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "filters": 48, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "conv3_6_x2_bn", "inbound_nodes": [[["conv3_6_x1", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_regularizer": null, "name": "conv3_6_x2_bn", "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.1e-05}}, {"class_name": "Scale", "name": "conv3_6_x2_scale", "inbound_nodes": [[["conv3_6_x2_bn", 0, 0, {}]]], "config": {"trainable": true, "momentum": 0.9, "axis": 3, "name": "conv3_6_x2_scale"}}, {"class_name": "Activation", "name": "relu3_6_x2", "inbound_nodes": [[["conv3_6_x2_scale", 0, 0, {}]]], "config": {"trainable": true, "name": "relu3_6_x2", "activation": "relu"}}, {"class_name": "ZeroPadding2D", "name": "conv3_6_x2_zeropadding", 