{"backend": "tensorflow", "keras_version": "2.0.4", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 256, 256, 1], "name": "data"}, "name": "data"}, {"inbound_nodes": [[["data", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 32, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": false, "name": "conv_1", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3]}, "name": "conv_1"}, {"inbound_nodes": [[["conv_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "name": "conv1_bn1", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv1_bn1"}, {"inbound_nodes": [[["conv1_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "relu1.1", "activation": "relu"}, "name": "relu1.1"}, {"inbound_nodes": [[["relu1.1", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_3"}, "name": "max_pooling2d_3"}, {"inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 32, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": true, "name": "pool1", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3]}, "name": "pool1"}, {"inbound_nodes": [[["pool1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "name": "conv1_bn2", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv1_bn2"}, {"inbound_nodes": [[["conv1_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "relu1.2", "activation": "relu"}, "name": "relu1.2"}, {"inbound_nodes": [[["relu1.2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_4"}, "name": "max_pooling2d_4"}, {"inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "name": "conv2_1_x1_bn", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv2_1_x1_bn"}, {"inbound_nodes": [[["conv2_1_x1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "relu2_1_x1", "activation": "relu"}, "name": "relu2_1_x1"}, {"inbound_nodes": [[["relu2_1_x1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 48, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": false, "name": "conv2_1_x1", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [1, 1]}, "name": "conv2_1_x1"}, {"inbound_nodes": [[["conv2_1_x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "name": "conv2_1_x2_bn", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv2_1_x2_bn"}, {"inbound_nodes": [[["conv2_1_x2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "relu2_1_x2", "activation": "relu"}, "name": "relu2_1_x2"}, {"inbound_nodes": [[["relu2_1_x2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "conv2_1_x2_zeropadding"}, "name": "conv2_1_x2_zeropadding"}, {"inbound_nodes": [[["conv2_1_x2_zeropadding", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 12, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": false, "name": "conv2_1_x2", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3]}, "name": "conv2_1_x2"}, {"inbound_nodes": [[["max_pooling2d_4", 0, 0, {"mask": [null, null]}], ["conv2_1_x2", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"dot_axes": -1, "mode_type": "raw", "output_shape": null, "mode": "concat", "output_mask": null, "output_mask_type": "raw", "arguments": {}, "output_shape_type": "raw", "name": "concat_2_1", "concat_axis": 3}, "name": "concat_2_1"}, {"inbound_nodes": [[["concat_2_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "name": "conv2_2_x1_bn", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv2_2_x1_bn"}, {"inbound_nodes": [[["conv2_2_x1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "relu2_2_x1", "activation": "relu"}, "name": "relu2_2_x1"}, {"inbound_nodes": [[["relu2_2_x1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 48, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": false, "name": "conv2_2_x1", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [1, 1]}, "name": "conv2_2_x1"}, {"inbound_nodes": [[["conv2_2_x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "name": "conv2_2_x2_bn", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv2_2_x2_bn"}, {"inbound_nodes": [[["conv2_2_x2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "relu2_2_x2", "activation": "relu"}, "name": "relu2_2_x2"}, {"inbound_nodes": [[["relu2_2_x2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "conv2_2_x2_zeropadding"}, "name": "conv2_2_x2_zeropadding"}, {"inbound_nodes": [[["conv2_2_x2_zeropadding", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 12, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": false, "name": "conv2_2_x2", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3]}, "name": "conv2_2_x2"}, {"inbound_nodes": [[["concat_2_1", 0, 0, {"mask": [null, null]}], ["conv2_2_x2", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"dot_axes": -1, "mode_type": "raw", "output_shape": null, "mode": "concat", "output_mask": null, "output_mask_type": "raw", "arguments": {}, "output_shape_type": "raw", "name": "concat_2_2", "concat_axis": 3}, "name": "concat_2_2"}, {"inbound_nodes": [[["concat_2_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "name": "conv2_3_x1_bn", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv2_3_x1_bn"}, {"inbound_nodes": [[["conv2_3_x1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "relu2_3_x1", "activation": "relu"}, "name": "relu2_3_x1"}, {"inbound_nodes": [[["relu2_3_x1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 48, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": false, "name": "conv2_3_x1", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [1, 1]}, "name": "conv2_3_x1"}, {"inbound_nodes": [[["conv2_3_x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "name": "conv2_3_x2_bn", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv2_3_x2_bn"}, {"inbound_nodes": [[["conv2_3_x2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "relu2_3_x2", "activation": "relu"}, "name": "relu2_3_x2"}, {"inbound_nodes": [[["relu2_3_x2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "conv2_3_x2_zeropadding"}, "name": "conv2_3_x2_zeropadding"}, {"inbound_nodes": [[["conv2_3_x2_zeropadding", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 12, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": false, "name": "conv2_3_x2", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3]}, "name": "conv2_3_x2"}, {"inbound_nodes": [[["concat_2_2", 0, 0, {"mask": [null, null]}], ["conv2_3_x2", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"dot_axes": -1, "mode_type": "raw", "output_shape": null, "mode": "concat", "output_mask": null, "output_mask_type": "raw", "arguments": {}, "output_shape_type": "raw", "name": "concat_2_3", "concat_axis": 3}, "name": "concat_2_3"}, {"inbound_nodes": [[["concat_2_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "name": "conv2_4_x1_bn", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv2_4_x1_bn"}, {"inbound_nodes": [[["conv2_4_x1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "relu2_4_x1", "activation": "relu"}, "name": "relu2_4_x1"}, {"inbound_nodes": [[["relu2_4_x1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 48, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": false, "name": "conv2_4_x1", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [1, 1]}, "name": "conv2_4_x1"}, {"inbound_nodes": [[["conv2_4_x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "name": "conv2_4_x2_bn", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv2_4_x2_bn"}, {"inbound_nodes": [[["conv2_4_x2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "relu2_4_x2", "activation": "relu"}, "name": "relu2_4_x2"}, {"inbound_nodes": [[["relu2_4_x2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "conv2_4_x2_zeropadding"}, "name": "conv2_4_x2_zeropadding"}, {"inbound_nodes": [[["conv2_4_x2_zeropadding", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 12, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": false, "name": "conv2_4_x2", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3]}, "name": "conv2_4_x2"}, {"inbound_nodes": [[["concat_2_3", 0, 0, {"mask": [null, null]}], ["conv2_4_x2", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"dot_axes": -1, "mode_type": "raw", "output_shape": null, "mode": "concat", "output_mask": null, "output_mask_type": "raw", "arguments": {}, "output_shape_type": "raw", "name": "concat_2_4", "concat_axis": 3}, "name": "concat_2_4"}, {"inbound_nodes": [[["concat_2_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "name": "conv2_5_x1_bn", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv2_5_x1_bn"}, {"inbound_nodes": [[["conv2_5_x1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "relu2_5_x1", "activation": "relu"}, "name": "relu2_5_x1"}, {"inbound_nodes": [[["relu2_5_x1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 48, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": false, "name": "conv2_5_x1", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [1, 1]}, "name": "conv2_5_x1"}, {"inbound_nodes": [[["conv2_5_x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "name": "conv2_5_x2_bn", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv2_5_x2_bn"}, {"inbound_nodes": [[["conv2_5_x2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "relu2_5_x2", "activation": "relu"}, "name": "relu2_5_x2"}, {"inbound_nodes": [[["relu2_5_x2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "conv2_5_x2_zeropadding"}, "name": "conv2_5_x2_zeropadding"}, {"inbound_nodes": [[["conv2_5_x2_zeropadding", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 12, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": false, "name": "conv2_5_x2", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3]}, "name": "conv2_5_x2"}, {"inbound_nodes": [[["concat_2_4", 0, 0, {"mask": [null, null]}], ["conv2_5_x2", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"dot_axes": -1, "mode_type": "raw", "output_shape": null, "mode": "concat", "output_mask": null, "output_mask_type": "raw", "arguments": {}, "output_shape_type": "raw", "name": "concat_2_5", "concat_axis": 3}, "name": "concat_2_5"}, {"inbound_nodes": [[["concat_2_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "name": "conv2_blk_bn", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv2_blk_bn"}, {"inbound_nodes": [[["conv2_blk_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "relu2_blk", "activation": "relu"}, "name": "relu2_blk"}, {"inbound_nodes": [[["relu2_blk", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 46, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": false, "name": "conv2_blk", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [1, 1]}, "name": "conv2_blk"}, {"inbound_nodes": [[["conv2_blk", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "pool2"}, "name": "pool2"}, {"inbound_nodes": [[["pool2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "name": "conv3_1_x1_bn", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv3_1_x1_bn"}, {"inbound_nodes": [[["conv3_1_x1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "relu3_1_x1", "activation": "relu"}, "name": "relu3_1_x1"}, {"inbound_nodes": [[["relu3_1_x1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 48, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": false, "name": "conv3_1_x1", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [1, 1]}, "name": "conv3_1_x1"}, {"inbound_nodes": [[["conv3_1_x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "name": "conv3_1_x2_bn", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv3_1_x2_bn"}, {"inbound_nodes": [[["conv3_1_x2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "relu3_1_x2", "activation": "relu"}, "name": "relu3_1_x2"}, {"inbound_nodes": [[["relu3_1_x2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "conv3_1_x2_zeropadding"}, "name": "conv3_1_x2_zeropadding"}, {"inbound_nodes": [[["conv3_1_x2_zeropadding", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 12, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": false, "name": "conv3_1_x2", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3]}, "name": "conv3_1_x2"}, {"inbound_nodes": [[["pool2", 0, 0, {"mask": [null, null]}], ["conv3_1_x2", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"dot_axes": -1, "mode_type": "raw", "output_shape": null, "mode": "concat", "output_mask": null, "output_mask_type": "raw", "arguments": {}, "output_shape_type": "raw", "name": "concat_3_1", "concat_axis": 3}, "name": "concat_3_1"}, {"inbound_nodes": [[["concat_3_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "name": "conv3_2_x1_bn", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv3_2_x1_bn"}, {"inbound_nodes": [[["conv3_2_x1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "relu3_2_x1", "activation": "relu"}, "name": "relu3_2_x1"}, {"inbound_nodes": [[["relu3_2_x1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 48, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": false, "name": "conv3_2_x1", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [1, 1]}, "name": "conv3_2_x1"}, {"inbound_nodes": [[["conv3_2_x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "name": "conv3_2_x2_bn", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv3_2_x2_bn"}, {"inbound_nodes": [[["conv3_2_x2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "relu3_2_x2", "activation": "relu"}, "name": "relu3_2_x2"}, {"inbound_nodes": [[["relu3_2_x2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "conv3_2_x2_zeropadding"}, "name": "conv3_2_x2_zeropadding"}, {"inbound_nodes": [[["conv3_2_x2_zeropadding", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 12, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": false, "name": "conv3_2_x2", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3]}, "name": "conv3_2_x2"}, {"inbound_nodes": [[["concat_3_1", 0, 0, {"mask": [null, null]}], ["conv3_2_x2", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"dot_axes": -1, "mode_type": "raw", "output_shape": null, "mode": "concat", "output_mask": null, "output_mask_type": "raw", "arguments": {}, "output_shape_type": "raw", "name": "concat_3_2", "concat_axis": 3}, "name": "concat_3_2"}, {"inbound_nodes": [[["concat_3_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "name": "conv3_3_x1_bn", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv3_3_x1_bn"}, {"inbound_nodes": [[["conv3_3_x1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "relu3_3_x1", "activation": "relu"}, "name": "relu3_3_x1"}, {"inbound_nodes": [[["relu3_3_x1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 48, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": false, "name": "conv3_3_x1", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [1, 1]}, "name": "conv3_3_x1"}, {"inbound_nodes": [[["conv3_3_x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "name": "conv3_3_x2_bn", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv3_3_x2_bn"}, {"inbound_nodes": [[["conv3_3_x2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "relu3_3_x2", "activation": "relu"}, "name": "relu3_3_x2"}, {"inbound_nodes": [[["relu3_3_x2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "conv3_3_x2_zeropadding"}, "name": "conv3_3_x2_zeropadding"}, {"inbound_nodes": [[["conv3_3_x2_zeropadding", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 12, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": false, "name": "conv3_3_x2", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3]}, "name": "conv3_3_x2"}, {"inbound_nodes": [[["concat_3_2", 0, 0, {"mask": [null, null]}], ["conv3_3_x2", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"dot_axes": -1, "mode_type": "raw", "output_shape": null, "mode": "concat", "output_mask": null, "output_mask_type": "raw", "arguments": {}, "output_shape_type": "raw", "name": "concat_3_3", "concat_axis": 3}, "name": "concat_3_3"}, {"inbound_nodes": [[["concat_3_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "name": "conv3_4_x1_bn", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv3_4_x1_bn"}, {"inbound_nodes": [[["conv3_4_x1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "relu3_4_x1", "activation": "relu"}, "name": "relu3_4_x1"}, {"inbound_nodes": [[["relu3_4_x1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 48, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": false, "name": "conv3_4_x1", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [1, 1]}, "name": "conv3_4_x1"}, {"inbound_nodes": [[["conv3_4_x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "name": "conv3_4_x2_bn", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv3_4_x2_bn"}, {"inbound_nodes": [[["conv3_4_x2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "relu3_4_x2", "activation": "relu"}, "name": "relu3_4_x2"}, {"inbound_nodes": [[["relu3_4_x2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "conv3_4_x2_zeropadding"}, "name": "conv3_4_x2_zeropadding"}, {"inbound_nodes": [[["conv3_4_x2_zeropadding", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 12, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": false, "name": "conv3_4_x2", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3]}, "name": "conv3_4_x2"}, {"inbound_nodes": [[["concat_3_3", 0, 0, {"mask": [null, null]}], ["conv3_4_x2", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"dot_axes": -1, "mode_type": "raw", "output_shape": null, "mode": "concat", "output_mask": null, "output_mask_type": "raw", "arguments": {}, "output_shape_type": "raw", "name": "concat_3_4", "concat_axis": 3}, "name": "concat_3_4"}, {"inbound_nodes": [[["concat_3_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "name": "conv3_5_x1_bn", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv3_5_x1_bn"}, {"inbound_nodes": [[["conv3_5_x1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "relu3_5_x1", "activation": "relu"}, "name": "relu3_5_x1"}, {"inbound_nodes": [[["relu3_5_x1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 48, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": false, "name": "conv3_5_x1", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [1, 1]}, "name": "conv3_5_x1"}, {"inbound_nodes": [[["conv3_5_x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "name": "conv3_5_x2_bn", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv3_5_x2_bn"}, {"inbound_nodes": [[["conv3_5_x2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "relu3_5_x2", "activation": "relu"}, "name": "relu3_5_x2"}, {"inbound_nodes": [[["relu3_5_x2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "conv3_5_x2_zeropadding"}, "name": "conv3_5_x2_zeropadding"}, {"inbound_nodes": [[["conv3_5_x2_zeropadding", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 12, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": false, "name": "conv3_5_x2", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3]}, "name": "conv3_5_x2"}, {"inbound_nodes": [[["concat_3_4", 0, 0, {"mask": [null, null]}], ["conv3_5_x2", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"dot_axes": -1, "mode_type": "raw", "output_shape": null, "mode": "concat", "output_mask": null, "output_mask_type": "raw", "arguments": {}, "output_shape_type": "raw", "name": "concat_3_5", "concat_axis": 3}, "name": "concat_3_5"}, {"inbound_nodes": [[["concat_3_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "name": "conv3_blk_bn", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv3_blk_bn"}, {"inbound_nodes": [[["conv3_blk_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "relu3_blk", "activation": "relu"}, "name": "relu3_blk"}, {"inbound_nodes": [[["relu3_blk", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 53, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": false, "name": "conv3_blk", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [1, 1]}, "name": "conv3_blk"}, {"inbound_nodes": [[["conv3_blk", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "pool3"}, "name": "pool3"}, {"inbound_nodes": [[["pool3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "name": "conv4_1_x1_bn", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv4_1_x1_bn"}, {"inbound_nodes": [[["conv4_1_x1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "relu4_1_x1", "activation": "relu"}, "name": "relu4_1_x1"}, {"inbound_nodes": [[["relu4_1_x1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 48, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": false, "name": "conv4_1_x1", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [1, 1]}, "name": "conv4_1_x1"}, {"inbound_nodes": [[["conv4_1_x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "name": "conv4_1_x2_bn", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv4_1_x2_bn"}, {"inbound_nodes": [[["conv4_1_x2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "relu4_1_x2", "activation": "relu"}, "name": "relu4_1_x2"}, {"inbound_nodes": [[["relu4_1_x2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "conv4_1_x2_zeropadding"}, "name": "conv4_1_x2_zeropadding"}, {"inbound_nodes": [[["conv4_1_x2_zeropadding", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 12, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": false, "name": "conv4_1_x2", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3]}, "name": "conv4_1_x2"}, {"inbound_nodes": [[["pool3", 0, 0, {"mask": [null, null]}], ["conv4_1_x2", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"dot_axes": -1, "mode_type": "raw", "output_shape": null, "mode": "concat", "output_mask": null, "output_mask_type": "raw", "arguments": {}, "output_shape_type": "raw", "name": "concat_4_1", "concat_axis": 3}, "name": "concat_4_1"}, {"inbound_nodes": [[["concat_4_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "name": "conv4_2_x1_bn", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv4_2_x1_bn"}, {"inbound_nodes": [[["conv4_2_x1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "relu4_2_x1", "activation": "relu"}, "name": "relu4_2_x1"}, {"inbound_nodes": [[["relu4_2_x1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 48, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": false, "name": "conv4_2_x1", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [1, 1]}, "name": "conv4_2_x1"}, {"inbound_nodes": [[["conv4_2_x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "name": "conv4_2_x2_bn", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv4_2_x2_bn"}, {"inbound_nodes": [[["conv4_2_x2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "relu4_2_x2", "activation": "relu"}, "name": "relu4_2_x2"}, {"inbound_nodes": [[["relu4_2_x2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]], "name": "conv4_2_x2_zeropadding"}, "name": "conv4_2_x2_zeropadding"}, {"inbound_nodes": [[["conv4_2_x2_zeropadding", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 12, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": false, "name": "conv4_2_x2", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3]}, "name": "conv4_2_x2"}, {"inbound_nodes": [[["concat_4_1", 0, 0, {"mask": [null, null]}], ["conv4_2_x2", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"dot_axes": -1, "mode_type": "raw", "output_shape": null, "mode": "concat", "output_mask": null, "output_mask_type": "raw", "arguments": {}, "output_shape_type": "raw", "name": "concat_4_2", "concat_axis": 3}, "name": "concat_4_2"}, {"inbound_nodes": [[["concat_4_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "name": "conv4_3_x1_bn", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "conv4_3_x1_bn"}, {"inbound_nodes": [[["conv4_3_x1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "relu4_3_x1", "activation": "relu"}, "name": "relu4_3_x1"}, {"inbound_nodes": [[["relu4_3_x1", 0, 0, {}]]], "class_name": 