{"keras_version": "2.0.4", "backend": "tensorflow", "class_name": "Model", "config": {"name": "densenet", "output_layers": [["prob", 0, 0]], "layers": [{"name": "data", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "data", "batch_input_shape": [null, 256, 256, 1], "dtype": "float32", "sparse": false}}, {"name": "conv_1", "inbound_nodes": [[["data", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "name": "conv_1", "filters": 32, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last"}}, {"name": "conv1_bn1", "inbound_nodes": [[["conv_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 1.1e-05, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv1_bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "axis": 3, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "relu1.1", "inbound_nodes": [[["conv1_bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu1.1", "trainable": true, "activation": "relu"}}, {"name": "max_pooling2d_3", "inbound_nodes": [[["relu1.1", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last", "trainable": true, "padding": "valid"}}, {"name": "pool1", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "name": "pool1", "filters": 32, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "data_format": "channels_last"}}, {"name": "conv1_bn2", "inbound_nodes": [[["pool1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 1.1e-05, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv1_bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "axis": 3, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "relu1.2", "inbound_nodes": [[["conv1_bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu1.2", "trainable": true, "activation": "relu"}}, {"name": "max_pooling2d_4", "inbound_nodes": [[["relu1.2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_4", "data_format": "channels_last", "trainable": true, "padding": "valid"}}, {"name": "conv2_1_x1_bn", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 1.1e-05, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_1_x1_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "axis": 3, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "relu2_1_x1", "inbound_nodes": [[["conv2_1_x1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu2_1_x1", "trainable": true, "activation": "relu"}}, {"name": "conv2_1_x1", "inbound_nodes": [[["relu2_1_x1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "name": "conv2_1_x1", "filters": 128, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last"}}, {"name": "conv2_1_x2_bn", "inbound_nodes": [[["conv2_1_x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 1.1e-05, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_1_x2_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "axis": 3, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "relu2_1_x2", "inbound_nodes": [[["conv2_1_x2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu2_1_x2", "trainable": true, "activation": "relu"}}, {"name": "conv2_1_x2_zeropadding", "inbound_nodes": [[["relu2_1_x2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv2_1_x2_zeropadding", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv2_1_x2", "inbound_nodes": [[["conv2_1_x2_zeropadding", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "name": "conv2_1_x2", "filters": 32, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last"}}, {"name": "concat_2_1", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {"mask": [null, null]}], ["conv2_1_x2", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"output_shape_type": "raw", "output_mask_type": "raw", "output_shape": null, "concat_axis": 3, "dot_axes": -1, "name": "concat_2_1", "mode_type": "raw", "output_mask": null, "arguments": {}, "mode": "concat"}}, {"name": "conv2_2_x1_bn", "inbound_nodes": [[["concat_2_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 1.1e-05, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_2_x1_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "axis": 3, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "relu2_2_x1", "inbound_nodes": [[["conv2_2_x1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu2_2_x1", "trainable": true, "activation": "relu"}}, {"name": "conv2_2_x1", "inbound_nodes": [[["relu2_2_x1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "name": "conv2_2_x1", "filters": 128, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last"}}, {"name": "conv2_2_x2_bn", "inbound_nodes": [[["conv2_2_x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 1.1e-05, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_2_x2_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "axis": 3, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "relu2_2_x2", "inbound_nodes": [[["conv2_2_x2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu2_2_x2", "trainable": true, "activation": "relu"}}, {"name": "conv2_2_x2_zeropadding", "inbound_nodes": [[["relu2_2_x2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv2_2_x2_zeropadding", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv2_2_x2", "inbound_nodes": [[["conv2_2_x2_zeropadding", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "name": "conv2_2_x2", "filters": 32, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last"}}, {"name": "concat_2_2", "inbound_nodes": [[["concat_2_1", 0, 0, {"mask": [null, null]}], ["conv2_2_x2", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"output_shape_type": "raw", "output_mask_type": "raw", "output_shape": null, "concat_axis": 3, "dot_axes": -1, "name": "concat_2_2", "mode_type": "raw", "output_mask": null, "arguments": {}, "mode": "concat"}}, {"name": "conv2_3_x1_bn", "inbound_nodes": [[["concat_2_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 1.1e-05, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_3_x1_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "axis": 3, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "relu2_3_x1", "inbound_nodes": [[["conv2_3_x1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu2_3_x1", "trainable": true, "activation": "relu"}}, {"name": "conv2_3_x1", "inbound_nodes": [[["relu2_3_x1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "name": "conv2_3_x1", "filters": 128, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last"}}, {"name": "conv2_3_x2_bn", "inbound_nodes": [[["conv2_3_x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 1.1e-05, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_3_x2_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "axis": 3, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "relu2_3_x2", "inbound_nodes": [[["conv2_3_x2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu2_3_x2", "trainable": true, "activation": "relu"}}, {"name": "conv2_3_x2_zeropadding", "inbound_nodes": [[["relu2_3_x2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv2_3_x2_zeropadding", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv2_3_x2", "inbound_nodes": [[["conv2_3_x2_zeropadding", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "name": "conv2_3_x2", "filters": 32, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last"}}, {"name": "concat_2_3", "inbound_nodes": [[["concat_2_2", 0, 0, {"mask": [null, null]}], ["conv2_3_x2", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"output_shape_type": "raw", "output_mask_type": "raw", "output_shape": null, "concat_axis": 3, "dot_axes": -1, "name": "concat_2_3", "mode_type": "raw", "output_mask": null, "arguments": {}, "mode": "concat"}}, {"name": "conv2_4_x1_bn", "inbound_nodes": [[["concat_2_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 1.1e-05, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_4_x1_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "axis": 3, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "relu2_4_x1", "inbound_nodes": [[["conv2_4_x1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu2_4_x1", "trainable": true, "activation": "relu"}}, {"name": "conv2_4_x1", "inbound_nodes": [[["relu2_4_x1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "name": "conv2_4_x1", "filters": 128, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last"}}, {"name": "conv2_4_x2_bn", "inbound_nodes": [[["conv2_4_x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 1.1e-05, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_4_x2_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "axis": 3, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "relu2_4_x2", "inbound_nodes": [[["conv2_4_x2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu2_4_x2", "trainable": true, "activation": "relu"}}, {"name": "conv2_4_x2_zeropadding", "inbound_nodes": [[["relu2_4_x2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv2_4_x2_zeropadding", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv2_4_x2", "inbound_nodes": [[["conv2_4_x2_zeropadding", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "name": "conv2_4_x2", "filters": 32, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last"}}, {"name": "concat_2_4", "inbound_nodes": [[["concat_2_3", 0, 0, {"mask": [null, null]}], ["conv2_4_x2", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"output_shape_type": "raw", "output_mask_type": "raw", "output_shape": null, "concat_axis": 3, "dot_axes": -1, "name": "concat_2_4", "mode_type": "raw", "output_mask": null, "arguments": {}, "mode": "concat"}}, {"name": "conv2_blk_bn", "inbound_nodes": [[["concat_2_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 1.1e-05, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_blk_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "axis": 3, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "relu2_blk", "inbound_nodes": [[["conv2_blk_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu2_blk", "trainable": true, "activation": "relu"}}, {"name": "conv2_blk", "inbound_nodes": [[["relu2_blk", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "name": "conv2_blk", "filters": 80, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last"}}, {"name": "pool2", "inbound_nodes": [[["conv2_blk", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "pool2", "data_format": "channels_last", "trainable": true, "padding": "valid"}}, {"name": "conv3_1_x1_bn", "inbound_nodes": [[["pool2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 1.1e-05, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_1_x1_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "axis": 3, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "relu3_1_x1", "inbound_nodes": [[["conv3_1_x1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu3_1_x1", "trainable": true, "activation": "relu"}}, {"name": "conv3_1_x1", "inbound_nodes": [[["relu3_1_x1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "name": "conv3_1_x1", "filters": 128, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last"}}, {"name": "conv3_1_x2_bn", "inbound_nodes": [[["conv3_1_x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 1.1e-05, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_1_x2_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "axis": 3, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "relu3_1_x2", "inbound_nodes": [[["conv3_1_x2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu3_1_x2", "trainable": true, "activation": "relu"}}, {"name": "conv3_1_x2_zeropadding", "inbound_nodes": [[["relu3_1_x2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv3_1_x2_zeropadding", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv3_1_x2", "inbound_nodes": [[["conv3_1_x2_zeropadding", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "name": "conv3_1_x2", "filters": 32, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last"}}, {"name": "concat_3_1", "inbound_nodes": [[["pool2", 0, 0, {"mask": [null, null]}], ["conv3_1_x2", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"output_shape_type": "raw", "output_mask_type": "raw", "output_shape": null, "concat_axis": 3, "dot_axes": -1, "name": "concat_3_1", "mode_type": "raw", "output_mask": null, "arguments": {}, "mode": "concat"}}, {"name": "conv3_2_x1_bn", "inbound_nodes": [[["concat_3_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 1.1e-05, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_2_x1_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "axis": 3, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "relu3_2_x1", "inbound_nodes": [[["conv3_2_x1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu3_2_x1", "trainable": true, "activation": "relu"}}, {"name": "conv3_2_x1", "inbound_nodes": [[["relu3_2_x1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "name": "conv3_2_x1", "filters": 128, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last"}}, {"name": "conv3_2_x2_bn", "inbound_nodes": [[["conv3_2_x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 1.1e-05, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_2_x2_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "axis": 3, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "relu3_2_x2", "inbound_nodes": [[["conv3_2_x2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu3_2_x2", "trainable": true, "activation": "relu"}}, {"name": "conv3_2_x2_zeropadding", "inbound_nodes": [[["relu3_2_x2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv3_2_x2_zeropadding", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv3_2_x2", "inbound_nodes": [[["conv3_2_x2_zeropadding", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "name": "conv3_2_x2", "filters": 32, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last"}}, {"name": "concat_3_2", "inbound_nodes": [[["concat_3_1", 0, 0, {"mask": [null, null]}], ["conv3_2_x2", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"output_shape_type": "raw", "output_mask_type": "raw", "output_shape": null, "concat_axis": 3, "dot_axes": -1, "name": "concat_3_2", "mode_type": "raw", "output_mask": null, "arguments": {}, "mode": "concat"}}, {"name": "conv3_3_x1_bn", "inbound_nodes": [[["concat_3_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 1.1e-05, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_3_x1_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "axis": 3, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "relu3_3_x1", "inbound_nodes": [[["conv3_3_x1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu3_3_x1", "trainable": true, "activation": "relu"}}, {"name": "conv3_3_x1", "inbound_nodes": [[["relu3_3_x1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "name": "conv3_3_x1", "filters": 128, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last"}}, {"name": "conv3_3_x2_bn", "inbound_nodes": [[["conv3_3_x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 1.1e-05, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_3_x2_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "axis": 3, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "relu3_3_x2", "inbound_nodes": [[["conv3_3_x2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu3_3_x2", "trainable": true, "activation": "relu"}}, {"name": "conv3_3_x2_zeropadding", "inbound_nodes": [[["relu3_3_x2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv3_3_x2_zeropadding", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv3_3_x2", "inbound_nodes": [[["conv3_3_x2_zeropadding", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "name": "conv3_3_x2", "filters": 32, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last"}}, {"name": "concat_3_3", "inbound_nodes": [[["concat_3_2", 0, 0, {"mask": [null, null]}], ["conv3_3_x2", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"output_shape_type": "raw", "output_mask_type": "raw", "output_shape": null, "concat_axis": 3, "dot_axes": -1, "name": "concat_3_3", "mode_type": "raw", "output_mask": null, "arguments": {}, "mode": "concat"}}, {"name": "conv3_4_x1_bn", "inbound_nodes": [[["concat_3_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 1.1e-05, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_4_x1_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "axis": 3, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "relu3_4_x1", "inbound_nodes": [[["conv3_4_x1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu3_4_x1", "trainable": true, "activation": "relu"}}, {"name": "conv3_4_x1", "inbound_nodes": [[["relu3_4_x1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "name": "conv3_4_x1", "filters": 128, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last"}}, {"name": "conv3_4_x2_bn", "inbound_nodes": [[["conv3_4_x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 1.1e-05, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_4_x2_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "axis": 3, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "relu3_4_x2", "inbound_nodes": [[["conv3_4_x2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu3_4_x2", "trainable": true, "activation": "relu"}}, {"name": "conv3_4_x2_zeropadding", "inbound_nodes": [[["relu3_4_x2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv3_4_x2_zeropadding", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv3_4_x2", "inbound_nodes": [[["conv3_4_x2_zeropadding", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "name": "conv3_4_x2", "filters": 32, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last"}}, {"name": "concat_3_4", "inbound_nodes": [[["concat_3_3", 0, 0, {"mask": [null, null]}], ["conv3_4_x2", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"output_shape_type": "raw", "output_mask_type": "raw", "output_shape": null, "concat_axis": 3, "dot_axes": -1, "name": "concat_3_4", "mode_type": "raw", "output_mask": null, "arguments": {}, "mode": "concat"}}, {"name": "conv3_blk_bn", "inbound_nodes": [[["concat_3_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 1.1e-05, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_blk_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "axis": 3, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "relu3_blk", "inbound_nodes": [[["conv3_blk_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu3_blk", "trainable": true, "activation": "relu"}}, {"name": "conv3_blk", "inbound_nodes": [[["relu3_blk", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "name": "conv3_blk", "filters": 104, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last"}}, {"name": "pool3", "inbound_nodes": [[["conv3_blk", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "pool3", "data_format": "channels_last", "trainable": true, "padding": "valid"}}, {"name": "conv4_1_x1_bn", "inbound_nodes": [[["pool3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 1.1e-05, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv4_1_x1_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "axis": 3, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "relu4_1_x1", "inbound_nodes": [[["conv4_1_x1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu4_1_x1", "trainable": true, "activation": "relu"}}, {"name": "conv4_1_x1", "inbound_nodes": [[["relu4_1_x1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "name": "conv4_1_x1", "filters": 128, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last"}}, {"name": "conv4_1_x2_bn", "inbound_nodes": [[["conv4_1_x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 1.1e-05, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv4_1_x2_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "axis": 3, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "relu4_1_x2", "inbound_nodes": [[["conv4_1_x2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu4_1_x2", "trainable": true, "activation": "relu"}}, {"name": "conv4_1_x2_zeropadding", "inbound_nodes": [[["relu4_1_x2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv4_1_x2_zeropadding", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv4_1_x2", "inbound_nodes": [[["conv4_1_x2_zeropadding", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "name": "conv4_1_x2", "filters": 32, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last"}}, {"name": "concat_4_1", "inbound_nodes": [[["pool3", 0, 0, {"mask": [null, null]}], ["conv4_1_x2", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"output_shape_type": "raw", "output_mask_type": "raw", "output_shape": null, "concat_axis": 3, "dot_axes": -1, "name": "concat_4_1", "mode_type": "raw", "output_mask": null, "arguments": {}, "mode": "concat"}}, {"name": "conv4_2_x1_bn", "inbound_nodes": [[["concat_4_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 1.1e-05, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv4_2_x1_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "axis": 3, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "relu4_2_x1", "inbound_nodes": [[["conv4_2_x1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu4_2_x1", "trainable": true, "activation": "relu"}}, {"name": "conv4_2_x1", "inbound_nodes": [[["relu4_2_x1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "name": "conv4_2_x1", "filters": 128, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last"}}, {"name": "conv4_2_x2_bn", "inbound_nodes": [[["conv4_2_x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 1.1e-05, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv4_2_x2_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "axis": 3, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "relu4_2_x2", "inbound_nodes": [[["conv4_2_x2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu4_2_x2", "trainable": true, "activation": "relu"}}, {"name": "conv4_2_x2_zeropadding", "inbound_nodes": [[["relu4_2_x2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv4_2_x2_zeropadding", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv4_2_x2", "inbound_nodes": [[["conv4_2_x2_zeropadding", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "name": "conv4_2_x2", "filters": 32, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last"}}, {"name": "concat_4_2", "inbound_nodes": [[["concat_4_1", 0, 0, {"mask": [null, null]}], ["conv4_2_x2", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"output_shape_type": "raw", "output_mask_type": "raw", "output_shape": null, "concat_axis": 3, "dot_axes": -1, "name": "concat_4_2", "mode_type": "raw", "output_mask": null, "arguments": {}, "mode": "concat"}}, {"name": "conv4_3_x1_bn", "inbound_nodes": [[["concat_4_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 1.1e-05, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv4_3_x1_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "axis": 3, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "relu4_3_x1", "inbound_nodes": [[["conv4_3_x1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu4_3_x1", "trainable": true, "activation": "relu"}}, {"name": "conv4_3_x1", "inbound_nodes": [[["relu4_3_x1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "name": "conv4_3_x1", "filters": 128, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last"}}, {"name": "conv4_3_x2_bn", "inbound_nodes": [[["conv4_3_x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 1.1e-05, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv4_3_x2_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "axis": 3, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "relu4_3_x2", "inbound_nodes": [[["conv4_3_x2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu4_3_x2", "trainable": true, "activation": "relu"}}, {"name": "conv4_3_x2_zeropadding", "inbound_nodes": [[["relu4_3_x2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv4_3_x2_zeropadding", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv4_3_x2", "inbound_nodes": [[["conv4_3_x2_zeropadding", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "name": "conv4_3_x2", "filters": 32, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last"}}, {"name": "concat_4_3", "inbound_nodes": [[["concat_4_2", 0, 0, {"mask": [null, null]}], ["conv4_3_x2", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"output_shape_type": "raw", "output_mask_type": "raw", "output_shape": null, "concat_axis": 3, "dot_axes": -1, "name": "concat_4_3", "mode_type": "raw", "output_mask": null, "arguments": {}, "mode": "concat"}}, {"name": "conv4_4_x1_bn", "inbound_nodes": [[["concat_4_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 1.1e-05, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv4_4_x1_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "axis": 3, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "relu4_4_x1", "inbound_nodes": [[["conv4_4_x1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu4_4_x1", "trainable": true, "activation": "relu"}}, {"name": "conv4_4_x1", "inbound_nodes": [[["relu4_4_x1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "name": "conv4_4_x1", "filters": 128, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last"}}, {"name": "conv4_4_x2_bn", "inbound_nodes": [[["conv4_4_x1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 1.1e-05, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv4_4_x2_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "axis": 3, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "relu4_4_x2", "inbound_nodes": [[["conv4_4_x2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu4_4_x2", "trainable": true, "activation": "relu"}}, {"name": "conv4_4_x2_zeropadding", "inbound_nodes": [[["relu4_4_x2", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv4_4_x2_zeropadding", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv4_4_x2", "inbound_nodes": [[["conv4_4_x2_zeropadding", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "name": "conv4_4_x2", "filters": 32, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last"}}, {"name": "concat_4_4", "inbound_nodes": [[["concat_4_3", 0, 0, {"mask": [null, null]}], ["conv4_4_x2", 0, 0, {"mask": [null, null]}]]], "class_name": "Merge", "config": {"output_shape_type": "raw", "output_mask_type": "raw", "output_shape": null, "concat_axis": 3, "dot_axes": -1, "name": "concat_4_4", "mode_type": "raw", "output_mask": null, "arguments": {}, "mode": "concat"}}, {"name": "conv4_blk_bn", "inbound_nodes": [[["concat_4_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 1.1e-05, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv4_blk_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "axis": 3, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "relu4_blk", "inbound_nodes": [[["conv4_blk_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "relu4_blk", "trainable": true, "activation": "relu"}}, 